[{"categories":["cloud native"],"date":1533958656,"description":"Today I am honored to announce that I have become a CNCF Ambassador.","image":"https://glennmdt.github.io/sdmxio/images/banner/cncf-ambassador.webp","objectID":"988ed799c4db425b97891523c5c0ec49","permalink":"https://glennmdt.github.io/sdmxio/blog/cloud-native-and-me-the-past-current-and-future/","summary":"Today I am honored to announce that I have become a CNCF Ambassador . Here is my story with Cloud Native. Origin The first time to attend the Cloud Native Computing Foundation is at the LC3 in Beijing 2017. I attended the meeting again this year, and in November of this year, CNCF will hold the KubeCon \u0026amp; CloudNativeCon for the first time in Shanghai, China. I\u0026rsquo;ll be there too. Cloud Native Books My origins with the Cloud Native is originated from Kevin Hoffman\u0026rsquo;s book Cloud Native Go . I translated this book at the end of 2016. Since then,","tags":["cncf"],"title":"Cloud Native and me - the past, current and future"},{"categories":["Istio"],"date":1652595520,"description":"This article will guide you on how to compile the Istio binaries on macOS.","image":"https://glennmdt.github.io/sdmxio/images/banner/build-istio.jpg","objectID":"cb1e6f2024eba4d0bfd6edf1a022479c","permalink":"https://glennmdt.github.io/sdmxio/blog/how-to-build-istio/","summary":"This article will guide you on how to compile the Istio binaries and Docker images on macOS.\nBefore you begin Before we start, refer to the Istio Wiki , here is the information about my build environment.\nmacOS 12.3.1 Darwin AMD64 Docker Desktop 4.8.1(78998) Docker Engine v20.10.14 Start to compile First, download the Istio code from GitHub to the $GOPATH/src/istio.io/istio directory, and execute the commands below in that root directory.\nCompile into binaries Execute the following command to download the Istio dependent packages, which will be downloaded to the vendor directory.\ngo mod vendor Run the following command to build Istio:","tags":["istio"],"title":"How to build Istio?"},{"categories":["istio"],"date":1625494920,"description":"This article explains three patterns/tools for debugging microservices in Kubernetes and the changes brought by the introduction of Istio for debugging microservices.","image":"https://glennmdt.github.io/sdmxio//images/banner/debug.jpg","objectID":"200d371631a86a888bac85875f092d92","permalink":"https://glennmdt.github.io/sdmxio/blog/how-to-debug-microservices-in-kubernetes-with-proxy-sidecar-or-service-mesh/","summary":"Kubernetes is arguably the best environment for running microservices so far, but the experience of debugging microservices in a Kubernetes environment may not be as user-friendly. This article will show you how to debug microservices in Kubernetes, introduce common tools, and explain how the introduction of Istio impacts debugging microservices.\nDebugging microservices is vastly different from traditional monolithic applications The debugging of microservices has been a long-standing problem for software developers. This challenge does not exist in traditional monolithic applications because developers can leverage the debugger in IDEs to add breakpoints, modify environment variables, single-step execution, etc. for their applications, all of which provide great help in software debugging.","tags":["istio","service mesh","telepresence","nocalhost"],"title":"How to debug microservices in Kubernetes with proxy, sidecar or service mesh?"},{"categories":["Istio"],"date":1604306607,"description":"Better integration of virtual machine-based workloads into the service mesh is a major focus for the Istio team this year, and Tetrate also provides seamless multi-cloud connectivity, security and observability, including for virtual machines, through its product Tetrate Service Bridge. This article will show you why Istio needs to integrate with virtual machines and how.","image":"https://glennmdt.github.io/sdmxio/images/banner/istio-logo.webp","objectID":"ac0050ad556dd1bfce8bbaa866099d4e","permalink":"https://glennmdt.github.io/sdmxio/blog/how-to-integrate-virtual-machines-into-istio-service-mesh/","summary":"Istio is a popular service mesh to connect, secure, control, and observe services. When it was first introduced as open source in 2017, Kubernetes was winning the container orchestration battle and Istio answered the needs of organizations moving to microservices. Although Istio claims to support heterogeneous environments such as Nomad, Consul, Eureka, Cloud Foundry, Mesos, etc., in reality, it has always worked best with Kubernetes — on which its service discovery is based.\nIstio was criticized for a number of issues early in its development, for the large number of components, the complexity of installation and maintenance, the difficulty of debugging, a steep learning curve due to the introduction of too many new concepts and objects (up to 50 CRDs), and the impact of Mixer components on performance.","title":"How to Integrate Virtual Machines into Istio Service Mesh"},{"categories":["Istio"],"date":1605775407,"description":"WorkloadGroup is a new API object. It is intended to be used with non-Kubernetes workloads like Virtual Machines and is meant to mimic the existing sidecar injection and deployment specification model used for Kubernetes workloads to bootstrap Istio proxies.","image":"https://glennmdt.github.io/sdmxio/images/banner/istio18.jpg","objectID":"e9933fccfc8df30cac30d1f811687aaa","permalink":"https://glennmdt.github.io/sdmxio/blog/istio-1-8-a-smart-dns-proxy-takes-support-for-virtual-machines-a-step-further/","summary":"1.8 is the last version of Istio to be released in 2020 and it has the following major updates:\nSupports installation and upgrades using Helm 3. Mixer was officially removed. Added Istio DNS proxy to transparently intercept DNS queries from applications. WorkloadGroup has been added to simplify the integration of virtual machines. WorkloadGroup is a new API object. It is intended to be used with non-Kubernetes workloads like Virtual Machines and is meant to mimic the existing sidecar injection and deployment specification model used for Kubernetes workloads to bootstrap Istio proxies.\nInstallation and Upgrades Istio starts to officially support the use of Helm v3 for installations and upgrades.","title":"Istio 1.8: A Smart DNS Proxy Takes Support for Virtual Machines a Step Further"}]